<script>
export default {
  name: "Tab2",
  data() {
    return {};
  },
};
</script>
<template>
  <div class="tab-container">
    <p class="title">古人为何写诗</p>
    <p>
      &emsp;&emsp;
      中国的诗歌从周朝开始，到钟嵘写《诗品》的时代，关于中国诗歌是怎样产生的，已有了更仔细的观察，也说得更加明白了。
      《诗品》中说：“气之动物，物之感人。故摇荡性情，形诸舞咏。”是什么东西使人感动呢？是“气”。宇宙的运行，万物的产生，都是因为有阴阳二气。
      宇宙之间阴阳两种气轮回运行，冬天来的时候，阴气越来越多。等到阴气发展到一个极点，到了最高的时候，阳就开始回来了；
      等到阳发展到最高的时候，阴就回来了。如此阴阳两气轮回，春天草木萌发开花，秋天草木黄落凋零。阴阳二气的运行，感动了宇宙万物。
      “物之感人”，人看到草木的生长，就欢喜，看到草木的黄落，就悲哀。因此，称之为“气之动物，物之感人”。“摇荡性情”，即令人的感情摇动了。
      人心有了感动以后，所以“形”，即表现出来，用诗歌表现出来。
    </p>
    <p>
      &emsp;&emsp;
      “形诸舞咏”的意思，如同《诗经·诗大序》上所说：“诗者，志之所之也，在心为志，发言为诗。
      情动于中而形于言，言之不足故嗟叹之，嗟叹之不足故永歌之，永歌之不足，不知手之舞之足之蹈之也。
      ”内心感动了，就形于言，可是有时候内心太感动，就“言之不足”。因为还没有把感动表现出来，所以“言之不足，故永（同“咏”）歌之”。
      由此可见，中国古人为什么摇头晃脑地吟诗呢？是因为只看，内心的感情不能抒发；文字没有声音，死死板板的，也不够。
      所以，要用你的声音，结合你的感情把诗表现出来。但是，“永（通“咏”）歌之不足”，你觉得只是出声音，也还不够。
      所以，你就“手之舞之足之蹈之”，即一边念诗，手里一边踏拍子。
    </p>
    <p>
      &emsp;&emsp;
      所以，人心之动，是“物使之然也”，是外物使你感动的。可是只是草木鸟兽使你感动吗？除了“落叶”“柔条”以外，还有什么使你感动？
    </p>
    <p>
      &emsp;&emsp;
      假如一个心没有死去的人，看到月明，看到花开，听到鸟叫，就会感动。
      跟你不同类的草木鸟兽都使你感动，那么你自己所看到的所经历的人类社会之中的种种现象，难道你无动于衷吗？
      不是的。所以，杜甫才会写出这样的诗来：“穷年忧黎元，叹息肠内热。
      ”在这样一个困穷的年代，当遍地是干戈战乱，当人民民不聊生的时候，我就为那些困苦的在患难中的“黎元”而忧伤。
      “黎元”就是百姓。“元”是善的意思。古人说“人之初，性本善”，人心是本善的。“黎”是黑色的意思。
      中国人是黑头发，所以秦朝的时候把老百姓叫黔首，意思是黑头。
      我看到老百姓的流离困苦，我为此而忧伤，不但口中叹息，还想到我们国家的患难，心里一阵发热，所以“叹息肠内热”。
      因此，使我们感动的一个更大的力量，就是我们人世间的种种事情。
    </p>
    <p style="text-align: end; color: #898989;">——摘编自叶嘉莹《中国诗歌史》课程讲稿</p>
  </div>
</template>
<style scoped lang="scss">
@import "../assets/tab.scss";
.tab-container{
  padding: 10px;
  p{
    line-height: 1.5;
    margin: 10px 0;
  }
  .title{
    text-align: center;
    font-weight: 600;
    margin: 5px 0;
    line-height: 2;
  }

}
</style>
