<script>
export default {
  name: "Tab3",
  data() {
    return {};
  },
};
</script>
<template>
  <div class="tab-container">
    <p class="title">古人在什么情境下写诗？</p>
    <ol>
      <li>非正式场合（举例）</li>
      <p>
        &emsp;&emsp;
        猜谜。例如，王维的《画》：“远看山有色，近听水无声。春去花还在，人来鸟不惊。”
        这首诗其实是一则谜语，每一句都是谜面，谜底就是诗题——“画”。
        第一句“远看山有色”，唐代山水画基本上是绘于墙壁的，以青绿重色为主，风格华丽灿烂，所以虽然是远看的群山，却仍然色彩绚烂。
        所以“山有色”。第二句“近听水无声”，凑近了听，流水潺潺，本该是有叮叮咚咚的声音，但怎么会没有声音呢？
        第三句“春去花还在”，春天过去，花儿本该谢了，却还依旧挂在枝头！
        到了第四句“人来鸟不惊”，山上的鸟远离人烟，本该对陌生的人类非常警觉，但是人走近了，鸟儿却一点都不害怕。
        细细推敲，就会发现诗里一个“画”字都没出现，却通篇都写了画的特点。
      </p>
      <p>
        &emsp;&emsp;
        友人赠答。例如，李白的《赠汪伦》：“李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺，不及汪伦送我情。”
        此处的汪伦，并不是历史上一个赫赫有名的大人物，只是安徽泾县的一个“豪士”。
        据说，汪伦是李白的头号粉丝，当他听说李白要来安徽南部山区游玩后，专门写了一封信去迎接他。
        信里说他的家乡有“十里桃花”“万家酒店”，李白先生您来了，一定欢喜！
        李白到了之后，汪伦才说出实话，原来“桃花”只是一片潭水的名字，并不是盛产桃花的地方，而“万家酒店”也只是店主人姓万而已。
        被骗来作客的李白听了后欣然大笑。后来，汪伦真诚地款待了李白好几天，李白倍受感动，临别时他发自肺腑地吟出了：“桃花潭水深千尺，不及汪伦送我情。”
        将自己的感情脱口而出。可见，真挚的朋友之间言语往往不需要修饰，诗也可以写得如此直白。
      </p>
      <p>
        &emsp;&emsp;
        抒情。例如，李白的《静夜思》：“床前明月光，疑是地上霜。举头望明月，低头思故乡。”
        写作《静夜思》时，李白已经离开家一年，正落脚在扬州的一家旅社。
        此时，他再看月亮，会想起什么呢？是不是有无忧无虑的童年，有家乡秀丽的山川，以及可爱的亲人呢？
        是不是他还会进一步想，天上月亮圆，那么地上的家人何时才能团圆呢？
        这首小诗虽然用语平淡，但抒发的却是非常纯净的赤子之心和思乡之情，也正是这首诗，让思乡情绪和月亮的意象从此紧密相连。
      </p>
      <li>正式场合（举例）</li>
      <p>
        &emsp;&emsp; 科举考试。
        例如，白居易的《赋得古原草送别》：“离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。”
        这首诗是与科举考试有关的。这首诗是行卷之作，所谓行卷就是应举者在考试前以所作诗文投送朝中显贵，寻求赏识，以提升自己的名气。
        据传，当时白居易怀着满腔抱负来到长安。他拿着自己的诗去拜见顾况，想通过他来拓展自己在长安的朋友圈。
        顾况一开始并不知道白居易的本事，看了他的名字后感叹了一句“米价方贵，居亦弗易”。
        顾况这是拿白居易的名字在打趣，长安物价很贵，要住下来不容易，言下之意是说，长安不好混饭吃，你没两把刷子，在这里可混不下去！
        不过，等到顾况读了白居易的这首《赋得古原草送别》之后，他马上改口了，说道：“道得个语，居即易矣。”
        意思就是，你能写出这样好的诗，想在长安立足一点也不难。虽然这个故事只是个传说，但它足以证明，白居易通过写诗证明了自己的才华。
        后来，白居易也确实靠科举，靠写诗的才华走上了仕途，成为了朝廷命官。
      </p>
    </ol>
  </div>
</template>
<style scoped lang="scss">
@import "../assets/tab.scss";
.tab-container {
  padding: 10px;
  p {
    line-height: 1.5;
    margin: 10px 0;
  }
  .title {
    text-align: center;
    font-weight: 600;
    margin: 5px 0;
    line-height: 2;
  }
  ol{
    li{
      font-weight: 600;
      margin: 20px;
    }
  }
}
</style>
